#include "stdafx.h"
#include "menu\submenus\main\sessionMenu.h"
#include "menu/submenus/main/weapon/weaponWeapons.h"
#include <regex>

Anticheat::pMetricCheatHook					Anticheat::OriginalMetricCheat;
Anticheat::pVirtualQueryEx					Anticheat::OriginalVirtualQueryEx;
Anticheat::pVirtualQuery					Anticheat::OriginalVirtualQuery;
Anticheat::pNtQueryVirtualMemoryHook		Anticheat::OriginalNtQueryVirtualMemory;
Anticheat::pCreateNetworkEventHook			Anticheat::OriginalCreateNetworkEvent;
Anticheat::pAddEventToListHook				Anticheat::OriginalAddEventToList;
Anticheat::pProcessMetricHook				Anticheat::OriginalProcessMetric;
Anticheat::pSigScanSystem					Anticheat::OriginalSigScanSystem;
Anticheat::pSigScanSystem					Anticheat::SigScanSystem;
Anticheat::pGrabPointersToNTDLLFunctions	Anticheat::GrabPointersToNTDLLFunctions;
Anticheat::pMessageBoxCrash					Anticheat::OriginalMessageBoxCrash;
Anticheat::pMessageBoxCrash					Anticheat::MessageBoxCrash;
uint64_t									Anticheat::m_addEventToListPointer;
uint64_t									Anticheat::m_tunables;
LPCRITICAL_SECTION							Anticheat::m_crcCriticalSectionPointer;

namespace MemePatch {
	map<uint64_t, vector<BYTE>> g_orig;
	void CopyBytes(uint64_t address, int size) {
		vector<BYTE> orig(size);
		memcpy(&orig[0], (void*)address, size);

		g_orig[address] = orig;
	}

	void PatchWithRetValue(const uint64_t address, const int value) {
		char buf[0x21];
		sprintf_s(buf, "\\x48\\xC7\\xC0\\x%02X\\x%02X\\x%02X\\x%02X\\xC3", value & 0xFF, value >> 8 & 0xFF,

static BOOL(WINAPI * OriginalReadProcessMemory)(HANDLE hProcess, LPCVOID lpBaseAddress, LPVOID lpBuffer, SIZE_T nSize, SIZE_T * lpNumberOfBytesRead) = ReadProcessMemory;
BOOL ReadProcessMemoryHook(HANDLE hProcess, LPCVOID lpBaseAddress, LPVOID lpBuffer, SIZE_T nSize, SIZE_T * lpNumberOfBytesRead) {
	if (!Backend::IsHooking()) {
		if (!Utils::Within((uint64_t)_ReturnAddress(), (uint64_t)Backend::GetModuleBase(), (Backend::GetModuleBase() + Backend::GetModuleSize()))) {
			if (Memory::IsScanInOurMemory((uint64_t)lpBaseAddress, (uint64_t)lpBaseAddress + nSize, Backend::GetModuleBase(), (Backend::GetModuleBase() + Backend::GetModuleSize()))) {
				LOG_DEVCUSTOM(ConsoleForeground::DARKRED, "[MemScan] memory scan RPM detected 0x%llx 0x%llx 0x%llx 0x%llx", (uint64_t)lpBaseAddress, (uint64_t)lpBaseAddress + nSize, Backend::GetModuleBase(), (Backend::GetModuleBase() + Backend::GetModuleSize()));
				return 0;
			}
		}
	}

	return OriginalReadProcessMemory(hProcess, lpBaseAddress, lpBuffer, nSize, lpNumberOfBytesRead);
}

bool SigScanSystemHook() {
	return 1; // inject in sp possibly
}

typedef bool(*pMetricHookOne)(void* Src);
typedef bool(*pMetricHookTwo)(unsigned int a1, __int64 a2, char a3);
typedef bool(*pMetricHookThree)(unsigned int a1, __int64 a2);

pMetricHookOne OrigMetricOne = nullptr;
pMetricHookTwo OrigMetricTwo = nullptr;
pMetricHookThree OrigMetricThree = nullptr;

bool MetricHandlerOneHook(uint64_t* src) {
	uint64_t classDefinition = *src;
	char* metricName = ((char* (*)())(void*) * (uint64_t*)(classDefinition + 0x18))();
#ifdef HARD_DEV
	if (Backend::IsLoaded())LOG_DEVCUSTOM(ConsoleForeground::DARKRED, "[CMetric 1] Name: %s, Offset: GTA5.exe+0x%llx", metricName, classDefinition - (uint64_t)GetModuleHandle(nullptr));
#endif
	return true;
}

bool MetricHandlerTwoHook(unsigned int a1, uint64_t* src, char a3) {
	uint64_t classDefinition = *src;
	char* metricName = ((char* (*)())(void*) * (uint64_t*)(classDefinition + 0x18))();

	if (strstr(metricName, "SES_JOIN")) {
		GetWindowManager()->m_chatComp.addLine("~r~________________Joined New session________________");
	}

#ifdef HARD_DEV
	if (Backend::IsLoaded())LOG_DEVCUSTOM(ConsoleForeground::DARKRED, "[CMetric 2] Name: %s, Offset: GTA5.exe+0x%llx", metricName, classDefinition - (uint64_t)GetModuleHandle(nullptr));
#endif
	return true;
}

bool MetricHandlerThreeHook(unsigned int a1, uint64_t* src) {
	uint64_t classDefinition = *src;
	char* metricName = ((char* (*)())(void*) * (uint64_t*)(classDefinition + 0x18))();

	if (strstr(metricName, "SPAWN")) {
		if (WeaponWeaponsMenuVars::vars.giveallweaponsloop) {
			GetFiberPool()->DoJob([] {
				WAIT(2000);
				WeaponWeaponsMenuVars::giveallweaponeverysesh();
			});
		}
	}

	if (strstr(metricName, "CASH_CREATED")) {
		if (SessionMenuVars::vars.warncashcreation) {
			GetRenderer()->NotifyMap(va("Cash is being dropped in your session"), false);
		}
	}

#ifdef HARD_DEV
	if (Backend::IsLoaded())LOG_DEVCUSTOM(ConsoleForeground::DARKRED, "[CMetric 3] Name: %s, Offset: GTA5.exe+0x%llx", metricName, classDefinition - (uint64_t)GetModuleHandle(nullptr));
#endif
	return true;
}

class NetData {
public:
	char* Data; //0x0000
}; //Size: 0x0008

class NetRequest {
public:
	char pad_0000[16]; //0x0000
	class NetData* RequestData; //0x0010
	char pad_0018[64]; //0x0018
	char* ResponseHeaders; //0x0058
	char pad_0060[40]; //0x0060
	char* RequestHeaders; //0x0088
	char pad_0090[1112]; //0x0090
	class NetData* ResponseData; //0x04E8
	char pad_04F0[4]; //0x04F0
	uint16_t ContentLength; //0x04F4
	char pad_04F6[18]; //0x04F6
	char* Scheme; //0x0508
	char* Host; //0x0510
	char* Path; //0x0518
	char pad_0520[72]; //0x0520
	char* UserAgent; //0x0568
	char pad_0570[3032]; //0x0570
	char* URLRequest; //0x1148
	char pad_1150[1432]; //0x1150
}; //Size: 0x16E8

typedef bool(__fastcall* updateRequest)(NetRequest* request);
static updateRequest __updateRequest;
static bool __fastcall _updateRequest(NetRequest* request) {
	if (request->RequestData && request->RequestData->Data) {
		//LOG_PRINT("Request to %s://%s%s:\n%s\n%s", request->Scheme, request->Host, request->Path, request->RequestHeaders ? request->RequestHeaders : "No headers available.", request->RequestData && request->RequestData->Data && strcmp(request->Scheme, "https") == 0 ? request->RequestData->Data : "null");

		const auto path = std::string(request->Path);

		for (auto blockedApi : { "SubmitCompressed", "SubmitRealTime", "Bonus" }) {
			if (path.find(blockedApi) != std::string::npos) {
				request->Host = "google.com";
				//request->Path = (char*)std::regex_replace(path, std::regex(blockedApi), "yikes").c_str();
